Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()).
If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail.
If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model.
This method should be called from a transaction.
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
-or-
There is no main EnergyAnalysisDetailModel in the document, or the current main EnergyAnalysisDetailModel is not compatible with the option set in the GBXMLExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.